/* 
 * 作者：钟勋 (e-mail:zhongxunking@163.com)
 */

/*
 * 修订记录:
 * @author 钟勋 2017-06-23 17:58 创建
 */
package org.antframework.common.util.money;

import org.antframework.common.util.validation.validator.CertNoValidator;
import org.junit.Assert;
import org.junit.Test;

/**
 *
 */
public class CertNoValidatorTest {

    @Test
    public void testValidate() {
        String[] certNos = {"15082119920706049X",
                "371427198602138238",
                "520382198609060089",
                "220112198309083907",
                "542523197712081365",
                "120113197603254138",
                "532627199203135247",
                "621001198808212882",
                "530925198302246177",
                "530328199308147066",
                "150802197707149863",
                "532526199101163165",
                "222402199101290835",
                "230109197502119579",
                "141127197508202789",
                "513321198001146616",
                "500112197807069895",
                "450000197801288792",
                "620823198510128582",
                "500383199006076054",
                "511123197709152283",
                "37172819930719770X",
                "469001197908170408",
                "360421198202109189",
                "350121198911103152",
                "451026199312058500",
                "131003198001194050",
                "621202198209281066",
                "141027197706236466",
                "23112419941227793X"};

        for (String certNo : certNos) {
            Assert.assertTrue(CertNoValidator.validate(certNo));
        }
    }

}
